medium={
    'rhea_28695_e':3.7,#HCO3
    'EX_photon_e':54.5,#光
    'rhea_29671_e': 1000.0,
    'rhea_28578_e': 1000.0,
    'rhea_28703_e': 1000.0,
    'rhea_34971_e': 1000.0,
    'EX_h_e': 1000.0,
    'rhea_29667_e': 1000.0,
    'rhea_29463_e': 1000.0,
    'rhea_29827_e': 1000.0,
    'rhea_28699_e': 1000.0,
    'rhea_34907_e': 1000.0,
    'rhea_34963_e': 1000.0,
    'rhea_34923_e': 1000.0,
    'EX_o2_e': 1000.0,
    'EX_pi_e': 1000.0,
    'rhea_34983_e': 1000.0,
    'rhea_29351_e': 1000.0,
    'rhea_28747_e' : 1000.0,  #NH4
    'rhea_33183_e':0.01, #citrate
}
# 缺少 Cl EDTA 柠檬酸（根）NH4 BO3 '
# 多了 Fe2 glucose Ni'
